{
    "Logging": {
        "IncludeScopes": false,
        "Debug": {
            "LogLevel": {
                "Default": "Warning"
            }
        },
        "Console": {
            "LogLevel": {
                "Default": "Warning"
            }
        }
    },
    "ConnectionStrings": {
        "DefaultConnection": "Data Source=context.db"
    },
    "ApiBaseUrl": "app/rest/",
    "ApiTitle": "GeekMD's Premier Health Solution REST API",
    "ApiVersion": "0.1-alpha",
    "ApiDescription": " REST web API that is robust, serves XML and JSON, provides API endpoints for persistence of core objects, and analytics modules to assist, simplify, and make time efficient clinical decisions. These analytics modules can be extended to web API users who do not have patient data in our persistence infrastructure as analytics modules are all activated by POST requests.",
    "ErrorDocumentationBaseUrl": "https://www.geekmd.io/phs/errorcodes/notimplemented/",
    "VisitsControllerDescription": "Access or create patient visits. The visits are accessible, to administrators, by filterable search. Filter options include PatientGuid, MedicalRecordNumber, Name, VisitMonth, VisitDay, VisitYear, and SortOrder",
    "PatientsControllerDescription": "Access or create patients. The patients are accessible, to administrators, by filterable search. Filter options include MedicalRecordNumber, Name, BirthMonth, BirthDay, BirthYear, and SortOrder",
    "AnalyticsControllerDescription": "Perform analytics on commonly acquired laboratory and other test data to help with clinical decision making. Of note, these analytics are not performed on data persisted on our servers. They are performed on properly formatted JSON or XML objects sent in the body of an HTTP POST request to the proper endpoint.",
    "DataControllerDescription": "Data for commonly collected patient laboratory and tests data during premier and executive health patient visits can be persisted and retrieved at their respective endpoints described at the end of this link."
}